uhnp/src/InformationRegisters/ПорядокУплатыНалоговНаМестах/ПорядокУплатыНалоговНаМестах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПорядокУплатыНалоговНаМестах</name>
  <informationRegisterPeriodicity>Year</informationRegisterPeriodicity>
  <resources>
    <name>УплачиваютсяАвансы</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Налог</name>
    <type>
      <types>EnumRef.ВидыИмущественныхНалогов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РегистрацияВНалоговомОргане</name>
    <type>
      <types>CatalogRef.РегистрацииВНалоговомОргане</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/ПорядокУплатыНалоговНаМестах/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Проверяет, установлено ли продление сроков уплаты налогов на региональном/местном уровне
//
// Параметры:
//  Организация - СправочникСсылка.Организации	 - организация, для которой проверяются настройки
//  Налог - Строка - идентификатор (код) налога, как он задан в справочнике ЗадачиБухгалтера, например "ТранспортныйНалог"
//  РегистрацияВНалоговомОргане - СправочникСсылка.РегистрацииВНалоговомОргане - ИФНС, в которой установлены продленные сроки уплаты региональных/местных налогов
//  Период - Дата - дата, на которую проверяются настройки
// 
// Возвращаемое значение:
//   - Булево
//
Функция ПродленыРегиональныеСрокиУплатыНалога(Организация, Налог, РегистрацияВНалоговомОргане, Период) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПорядокУплатыНалоговНаМестахСрезПоследних.Налог КАК Налог
	|ИЗ
	|	РегистрСведений.ПорядокУплатыНалоговНаМестах.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И Налог = &Налог
	|				И РегистрацияВНалоговомОргане = &РегистрацияВНалоговомОргане) КАК ПорядокУплатыНалоговНаМестахСрезПоследних
	|ГДЕ
	|	ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Налог",       Перечисления.ВидыИмущественныхНалогов[Налог]);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Период",      Период);
	Запрос.УстановитьПараметр("РегистрацияВНалоговомОргане", РегистрацияВНалоговомОргане);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат Не РезультатЗапроса.Пустой();
	
КонецФункции 

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#КонецЕсли
